#include <QString>
#include <ppn.h>
#include "formula.h"


//QString signal_strings[Columns][Rows] {
QString signal_strings[]
{ // 0й столбец, название
"Т ГРЧН1, °С", "Т ГРЧН2, °С", "Т ГРЧН3, °С", "Т ГРЧН4, °С", "Р РЕАК, кгс/см2",
"Р ГПК", "F ПИТ ГЦН1", "F ПИТ ГЦН2", "F ПИТ ГЦН3", "F ПИТ ГЦН4", "Р ТРОП ПГ1",
"Р ТРОП ПГ2", "Р ТРОП ПГ3", "Р ТРОП ПГ4", "Р ЗКП ТПН1", "Р ЗКП ТПН2", "Р ГАЗ06/1",
"L КД", "P-P ГЦН1", "P-P ГЦН2", "P-P ГЦН3", "P-P ГЦН4", "МЭД ГЦН1, КВт", "МЭД ГЦН2, КВт",
"МЭД ГЦН3, КВт", "МЭД ГЦН4, КВт", "L ПГ1, см", "L ПГ2, см", "L ПГ3, см", "L ПГ4, см"
};
QString ppnCol2[]
{ // 1й столбец, единицы измерения
"°С  мВ  Ом",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
""
};

QString ppnCol3 {
    "↑ ТЭП ↓"
    "↑ ТСП ↓ "

};




